app/views/opinions/_recent_tweets.html.erb

    <div class="media my-3 bg-white p-2 rounded shadow">
      <%= image_tag tweet.user.profile_images.first.image.url,
       class: 'align-self-start mr-3 rounded-circle' %>
---
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?)  [["id", 4], ["id", 3]]