app/views/opinions/index.html.erb

    <div class="media my-3">
      <%= image_tag tweet.user.profile_images.first.image.url,
       class: 'align-self-center mr-3 rounded' %>
---
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?, ?, ?, ?)  [["id", 6], ["id", 5], ["id", 4], ["id", 3], ["id", 2]]