app/views/comments/_comments.html.erb

    <div class="media my-2">
      <%= image_tag comment.user.profile_images.first.image.url,
       class: 'align-self-end mr-3 rounded-circle' %>
---
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?)  [["id", 4], ["id", 3]]