app/controllers/comments_controller.rb

INSERT INTO "comments" ("user_id", "opinion_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 3], ["opinion_id", 2], ["content", "here i go"], ["created_at", "2020-06-11 12:56:11.990390"], ["updated_at", "2020-06-11 12:56:11.990390"]]
---
  def create
    @comment = Comment.new(comment_params)
    @comment.user_id = current_user.id
    flash[:notice] = if @comment.save