app/controllers/opinions_controller.rb

  def index
    @tweets = current_user.visible_opinions.includes(:user)
---
SELECT "opinions".* FROM "opinions" WHERE "opinions"."id" IN (?, ?, ?, ?, ?) ORDER BY "opinions"."id" DESC LIMIT ?  [["id", 2], ["id", 3], ["id", 4], ["id", 5], ["id", 6], ["LIMIT", 11]]
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?, ?, ?, ?, ?, ?) ORDER BY "users"."id" DESC  [["id", 11], ["id", 13], ["id", 10], ["id", 8], ["id", 9], ["id", 7], ["id", 12]]

  def create
    @opinion = current_user.opinions.new(opinion_params)

    respond_to do |format|
      if @opinion.save
---
INSERT INTO "opinions" ("author_id", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["author_id", 1], ["text", "Heeyyy"], ["created_at", "2020-06-09 13:38:35.884174"], ["updated_at", "2020-06-09 13:38:35.884174"]]

  def set_opinion
    @opinion = Opinion.find(params[:id])
---
SELECT "opinions".* FROM "opinions" WHERE "opinions"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]