app/controllers/sessions_controller.rb

  def create
    puts 'CREATE IN SESSIONS'
    @user = User.find_by(username: params[:user][:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "Kubilay"], ["LIMIT", 1]]