app/controllers/users_controller.rb

SELECT "followings".* FROM "followings" WHERE "followings"."follower_id" IN (?, ?)  [["follower_id", 4], ["follower_id", 3]]
SELECT "users"."id" FROM "users" INNER JOIN "followings" ON "users"."id" = "followings"."followed_id" WHERE "followings"."follower_id" = ?  [["follower_id", 3]]
---
  def index
    @users = User.all.order(id: :desc).includes(:opinions, :profile_images, :followings, :followers)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
  def show
    @user = User.find(params[:id])
    @followers = @user.followers.includes(:profile_images)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
  def edit
    @user = User.find(params[:id])
    @cover_image = @user.cover_images.build unless @user.cover_images.exists?

INSERT INTO "photos" ("user_id", "created_at", "updated_at", "image_type") VALUES (?, ?, ?, ?)  [["user_id", 13], ["created_at", "2020-06-09 13:21:13.550855"], ["updated_at", "2020-06-09 13:21:13.550855"], ["image_type", "cover"]]
INSERT INTO "users" ("username", "fullname", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "Başarı"], ["fullname", ""], ["created_at", "2020-06-09 13:21:13.546574"], ["updated_at", "2020-06-09 13:21:13.546574"]]
INSERT INTO "photos" ("image_file_name", "image_content_type", "image_file_size", "image_updated_at", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    photo_cover = Photo.new(user_id: @user.id, image_type: 'cover')
    photo_cover.image = URI.parse('https://ak.picdn.net/shutterstock/videos/12243746/thumb/1.jpg')

    photo_profile = Photo.new(user_id: @user.id, image_type: 'profile')
    photo_profile.image = URI.parse('https://cdn.iconscout.com/icon/free/png-512/avatar-372-456324.png')

    @user.cover_images << photo_cover
    @user.profile_images << photo_profile
    if @user.save

UPDATE "users" SET "fullname" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["fullname", ""], ["updated_at", "2020-06-09 12:12:52.165797"], ["id", 6]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)