app/controllers/users_controller.rb

  def set_user
    if params[:id].to_i > User.last.id.to_i
---
SELECT "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT ?  [["LIMIT", 1]]