app/models/user.rb

SELECT "photos".* FROM "photos" WHERE "photos"."user_id" = ? AND "photos"."image_type" = ? ORDER BY "photos"."id" ASC LIMIT ?  [["user_id", 14], ["image_type", "profile"], ["LIMIT", 1]]
---
  def self.initialize_with_images(user_params)
    @user = User.new(user_params)
    photo_cover = Photo.new(user_id: @user.id, image_type: 'cover')
    photo_cover.image = File.new(Rails.root.join('public', 'images', 'cover.jpg'))
    photo_profile = Photo.new(user_id: @user.id, image_type: 'profile')
    photo_profile.image = File.new(Rails.root.join('public', 'images', 'profile2.png'))

SELECT "users"."id" FROM "users"
---
  def visible_opinions
    ids = followings.ids << id